server/app/controllers/posts_controller.rb

    def index
        posts = Post.all.order("created_at DESC");
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def show
        post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create

        if logged_in?
            @post = Post.new(post_params)
            @post.user_id = current_user.id
            if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fdsfdsf"], ["body", "fdfsf"], ["created_at", "2020-10-13 16:12:56.390172"], ["updated_at", "2020-10-13 16:12:56.390172"], ["user_id", 1]]